import React from "react";
import './legend.scss';

const Legend = () => {
    return (
        <section className="legend">
            <header className="header">
           
            
                <h2 style={{fontSize: '2rem', marginTop: '8px'}}>В очікуванні Зимовершника</h2>
                <p>
                    Привіт, Перевершнику! 🎁 
                </p>
                <p>
                    Настав час найчарівнішого періоду року — Свята Зимовершника! Що це за дивина, спитаєш ти? А ми відповімо: це аж два місяці веселощів, подарунків і справжньої святкової магії. А знаєш, що робить це свято особливим? Магічні герої, які приносять радість: Санта Клаус мчить з подарунками в Північній Америці, Йоулупуккі дзвенить дзвіночком у Фінляндії, Пер Ноель змагається з Бефаною за швидкість у Франції та Італії. А у Fozzy є свій неповторний чарівник — Зимовершник!
                </p>
                <p>
                    Це наш казковий мандрівник, який збирає радість і тепло по всьому світу, щоби подарувати їх тобі, Перевершнику. І цього року він подорожує не сам, а зі своїми друзями:
                </p>
                <p>
                    <b> 🦌 Олень Зимко:</b> той самий, хто тягне корабель з такою силою, що хвилі розступаються! Його роги — це GPS у світі океанів. 
                    </p>
                    <p>
                    <b> 🕊️ Голуб Го-Го:</b> найшвидший месенджер серед птахів! Літає навколо, співає пісні і перевіряє, чи все йде за планом. 🕊️
                    </p>
                <p>
                       Разом ця команда вирушила в захопливу подорож до Острова Цейлон, щоби привезти особливий подаруночок для тебе. Та що їх чекає на зворотному шляху? Вони сміливо долатимуть бурі, змагатимуться з хвилями й робитимуть усе, щоб сама подорож дарувала тобі святковий настрій! Тож готуйся — свято вже близько 🎶
                </p>
                <div className="zymo-logo">
                    <img src="https://zymovershnyk.fun/images/logo.svg" alt='logo' />
                </div>
             </header>
        </section>
    )
}

export default Legend